<template>
  <div>
    <!-- 
  隐私政策
-->
    <el-dialog :visible.sync="agreeVisibleParent" :title="title" width="800" @close="closeDialog" center
      :modal-append-to-body="false" :append-to-body="true">
      <div v-if="agreeVisibleOne">
        <div class="agree_cont">
          深圳找房网络科技有限公司（下文简称“{{ httpUrls.name }}”、“我们”和“我们的”）深知隐私对您的重要性，并会尊重您的隐私以及保障您的隐私数据的安全。请在{{ httpUrls.name
          }}提交个人数据之前，阅读、了解本《隐私政策》（下文简称“本政策”）。本政策适用于深圳天眼云客信息技术有限公司开发及联合开发的包括但不限于显示本隐私政策、或链接至本隐私政策的所有{{ httpUrls.name
}}网站和产品、服务。<br />
          本政策阐述了{{ httpUrls.name }}如何搜集、使用及处理您的个人数据，但本政策可能并不涉及所有可能的数据处理情形。有关收集产品或服务特定数据的提示信息可能由{{ httpUrls.name
          }}被不断地、定时地被补充在政策中，或者在收集数据时提供的通知中发布。<br />
          “您”是指所有使用{{ httpUrls.name }}产品享受{{ httpUrls.name }}提供的服务的自然人及法人组织（包括企业内使用{{ httpUrls.name
          }}产品系统的所有成员），而不单纯限于购买、下载、对接服务的管理人员。<br />
          请您知悉，您在使用{{ httpUrls.name }}产品或服务时，可能需要您根据本政策描述的场景及方式提供您的个人数据。在某些情况下，您可以选择不向{{ httpUrls.name
          }}提供个人数据，但如果您选择不提供，{{ httpUrls.name }}可能无法为您提供相关产品或服务，也无法回应或解决您所遇到的问题。<br />
          请您认真且仔细地阅读本《隐私政策》，并将您是否同意/许可本政策的描述及授权{{ httpUrls.name }}按照本政策的描述搜集、使用及处理您的数据，以您是否持续或继续使用{{ httpUrls.name
          }}产品及服务的形式体现。且请您知悉，被授权的主体包含{{ httpUrls.name }}信息咨询有限公司及其全球范围内的所有关联公司及其全球关联公司平台产品，如：您的授权将视为您同意在您注册{{
  httpUrls.name }}通行证后，允许{{ httpUrls.name }}及关联平台产品获取及使用您的用户注册信息。<br />
          我们制定本政策的目的在于帮助您了解以下内容：<br />
          <ul>
            <li>1.我们如何收集和使用您的个人数据</li>
            <li>2.我们如何使用 Cookie 和同类技术</li>
            <li>3.我们如何披露您的个人数据</li>
            <li>4.我们如何访问或修改您的个人数据</li>
            <li>5.我们如何保护您的个人数据</li>
            <li>6.我们如何处理儿童的个人数据</li>
            <li>7.第三方提供商及其服务</li>
            <li>8.您的个人数据如何在全球范围转移</li>
            <li>9.本政策如何更新</li>
          </ul>
          <div class="argee_title">1. 我们如何收集和使用您的个人数据</div>
          个人数据是指单独使用或结合其他信息使用时能够识别个人身份的信息。此类数据会在您使用我们的网站、产品或服务，以及与我们互动时由您直接提交给我们，例如，当您创建我们的账户或联系我们获得支持时；或者我们通过记录您如何与我们的网站、产品或服务交互而获得，例如，通过Cookie等技术，或者从您设备上运行的软件接收使用数据。在法律允许的情况下，我们还会从公用和商用第三方来源获取有关数据，例如，我们通过从其他公司购买统计数据来支持我们的服务。我们收集的数据取决于您与{{
            httpUrls.name
          }}互动的方式，包括访问的网站或者使用的产品和服务等，包括姓名、性别、企业名称、职位、地址、电子邮箱、电话号码、登录信息（帐号和密码）、照片、证件信息等。我们还收集您提供给我们的信息和您发给我们的消息内容，例如您输入的查询信息或您为了获得客服支持而提供的问题或信息。获取技术支持服务时，可能会需要您提供服务凭证，用于技术支持识别客户信息。服务凭证在数据决策平台—注册管理页面生成，服务凭证内包含公司ID、项目ID、合同ID信息。<br />
          <div class="argee_title-little">1.1 如何搜集数据</div>
          以下，我们将向您展示{{ httpUrls.name }}的产品及服务将在哪些场景下及如何搜集您的数据：<br />
          （1）产品注册<br />
          您开始使用{{ httpUrls.name }}产品时，注册时所提供的信息将用于创建您的用户账号，包括：您部署完成的系统中某个用户的账号和密码以及您的系统所在的服务器用户的账号和密码。并且在您联系{{
            httpUrls.name }}用户服务部门时， 这些信息还将协助{{ httpUrls.name
  }}为您提供支持，在您的授权下帮助您完成某个特定的功能使用，包括但不限于升级、配置集群、调试、还原、解决某个具体问题，正常使用产品。此外，{{ httpUrls.name
}}还将使用这些信息来通知您有关您可能感兴趣的任何升级、新产品、促销或其他信息。<br />
          （2）产品使用<br />
          {{ httpUrls.name }}可能将产品使用中收集的信息用于：定期验证您对产品的使用权利； 向您发送新产品/新功能升级的通知前，确认您是否正在使用该产品/功能的较早版本或者是否会对您使用{{
            httpUrls.name }}有所帮助； 以及，{{ httpUrls.name }}接收您请求获取的产品内部消息。<br />
          （3）内部分析<br />
          我们对于这些数据的收集和使用，都是为了向您提供服务且保障服务的正常运行和您所使用帐号的安全、并且帮助发现您在使用{{ httpUrls.name
          }}产品及服务过程中遇到的问题，以提示我们及时对产品功能及服务做出改进和优化，最终给您带来更好的产品和服务体验；以及为您提供更适合您的配置方案建议，促使您可以更便捷地根据您自身的基础条件和个性化需求，更优更充分使用地使用{{
  httpUrls.name }}产品。<br />
          包括：<br />
          <ul>
            <li>1.我们会搜集一些用于识别您身份的数据，帮助我们为您提供更准确的服务；</li>
            <li>2.我们会搜集一些关于您使用{{ httpUrls.name }}产品时部署发服务器的环境信息，包括您系统的容量以及版本等；</li>
            <li>3.我们会搜集一些关于您使用{{ httpUrls.name }}产品的工程配置信息；</li>
            <li>4.我们会搜集一些关于您的操作偏好信息，帮助改善及提升您的使用感受和服务体验。</li>
          </ul>
          （4）问题处理<br />
          为帮助解决您在使用{{ httpUrls.name }}产品的过程中出现的不同程度的问题及帮助我们改善产品功能，我们可能出于准确定位问题，需要授权获取您的：<br />
          <ul>
            <li>1.日志文件，包括但不限于dump文件、log等类型的日志文件；</li>
            <li>2.工程文件，（其中不包括您数据库中的数据），仅用于尝试还原和分析您系统中遇到的某个隐患问题，并且问题还原和分析完成后，会删除工程文件，不再使用；</li>
            <li>
              3.报错界面截图：可能存在需要您主动提供报错界面截图或者在错误发生时，为更快更及时地定位错误发生原因采取的自动截图等的情况，请您知悉，我们仅关注错误原因相关的信息，并且从不会将截图可能覆盖的数据对任何第三方进行披露。
            </li>
          </ul>
          <div class="argee_title-little">1.2 搜集数据的目的</div>
          以下，我们可能将您的个人数据用于以下目的：<br />
          <ul>
            <li>(a) 创建账户。</li>
            <li>(b)
              实现您的交易或服务请求，包括履行订单；交付、激活或验证产品或服务；提供培训及认证并管理和处理培训及认证结果；参加线上或线下活动；应您的要求进行变更或者提供您请求的信息（例如产品或服务的营销资料、白皮书）；以及提供技术支持。
            </li>
            <li>(c) 在您同意的情况下，与您联系；向您发送有关您可能感兴趣的产品和服务的信息；邀请您参与{{ httpUrls.name
            }}活动（包括促销活动）、市场调查或满意度调查；或向您发送营销信息。如果您不想接收此类信息，则可以随时退订。</li>
            <li>(d) 向您发送重要通知，如操作系统或应用程序更新和安装的通知。</li>
            <li>(e) 为您提供个性化用户体验和个性化内容。</li>
            <li>(f) 认证和管理供应商及业务合作伙伴，与供应商及业务合作伙伴沟通或开展业务。</li>
            <li>(g) 开展内部审计、数据分析和研究，改善我们的产品和服务。</li>
            <li>(h) 分析业务运营效率并衡量市场份额。</li>
            <li>(i) 在您选择向我们发送错误详情的情况下排查错误。</li>
            <li>(j) 同步、共享和存储您上传或下载的数据以及执行上传和下载所需的数据。</li>
            <li>(k) 保护我们产品、服务和客户或用户的安全，执行与改善我们的防损和反欺诈计划。</li>
            <li>(l) 遵从和执行适用的法律要求，相关的行业标准或我们的政策。</li>
          </ul>
          <div class="argee_title-little">1.3 非识别数据</div>
          {{ httpUrls.name }}还可能收集和使用非识别性数据。非识别性数据是指无法用于确定个人身份的数据。非识别性数据主要包含如下类别：<br />
          <ul>
            <li>(a) 产品终端（设计器&移动端）的版本信息。</li>
            <li>(b) 产品终端（设计器&移动端）功能使用量统计（包含模板制作耗时、alphafine功能记录）。</li>
            <li>(c) 产品终端（设计器&移动端）奔溃程序错误日志。</li>
            <li>(d) 产品终端（设计器&移动端）连接的服务器基本环境信息（产品版本、环境容器类型、JDK版本等）。</li>
            <li>(e) 产品终端（设计器&移动端）连接的服务器的产品功能使用统计（功能使用量、模板使用量等）。</li>
          </ul>
          {{ httpUrls.name }}收集此数据的目的在于了解用户如何使用自己的产品和服务。借此，{{ httpUrls.name }}可以改善自己的服务，更好地满足客户需求。{{ httpUrls.name
          }}可能会自行决定出于其他目的收集、使用、处理、转移或披露非识别性数据。 我们会尽力隔离您的个人数据和非识别性数据，并单独使用这两种数据。如果个人数据掺杂了非识别性数据，依旧会被视作个人数据处理。<br />
          <div class="argee_title-little">1.4 数据的合法化处理</div>
          当{{ httpUrls.name }}处理您的个人数据时我们会遵从适用的法律的要求基于适当的合法性基础予以处理，包括：<br />
          <ul>
            <li>当响应您的交易或服务请求时为履行合同处理您的个人数据；</li>
            <li>基于您的同意处理您的个人数据；</li>
            <li>
              当与您联系、进行营销或市场调查，为改善我们的产品和服务，执行与改善我们的防损和反欺诈计划等目的处理您的个人数据时我们将基于我们或第三方的合法利益。这些合法利益包括，使我们能够更有效的管理和运营我们的业务并提供我们的产品和服务；保护我们的业务、系统、产品、服务和客户的安全；内部管理，遵从内部的政策和流程；我们在本政策中描述的其他合法利益等；
            </li>
            <li>我们还可能基于遵从和执行法律义务处理您的个人数据。</li>
          </ul>
          <div class="argee_title">2. 我们如何使用 Cookie 和同类技术</div>
          <div class="argee_title-little">2.1 Cookie</div>
          为确保网站正常运转，我们有时会在计算机或移动设备上存储名为 Cookie 的小数据文件。Cookie 是一种网络服务器存储在计算机或移动设备上的纯文本文件。Cookie 的内容只能由创建它的服务器检索或读取。每个
          Cookie 对您的网络浏览器或移动应用程序都是唯一的。Cookie 通常包含标识符、站点名称以及一些号码和字符。借助于 Cookie，网站能够存储用户偏好或购物篮内的商品等数据。<br />
          {{ httpUrls.name }}启用Cookie的目的与大多数网站或互联网服务提供商启用 Cookie 的目的一样，即改善用户体验。借助于 Cookie，网站能够记住用户的单次访问（使用会话
          Cookie）或多次访问（使用永久 Cookie）。借助于 Cookie，网站能够保存设置，例如计算机或移动设备的语言、字体大小和其他浏览偏好。这意味着，用户无需在每次访问时重新配置用户偏好设置。如果某个网站不使用
          Cookie，那么在用户每一次打开网页时，该网站都会将其视为新访客。例如，如果您登录某个网站后转到另一个网页，该网站就不会识别出您，而您会被再次注销。 {{ httpUrls.name }}不会将 Cookie
          用于本政策所述目的之外的任何用途。您可根据自己的偏好管理或删除 Cookie。
          <div class="argee_title-little">2.2 网站信标和像素标签</div>
          除 Cookie 外，我们还会在网站上使用网站信标和像素标签等其他同类技术。例如，{{ httpUrls.name }}向您发送的电子邮件可能含有链接至{{ httpUrls.name }}网站内容的点击
          URL。如果您点击该链接，{{ httpUrls.name
          }}则会跟踪此次点击，帮助我们了解您的产品和服务偏好并改善客户服务。网站信标通常是一种嵌入到网站或电子邮件中的透明图像。借助于电子邮件中的像素标签，我们能够获知电子邮件是否被打开。如果您不希望自己的活动以这种方式被追踪，则可以随时从{{
  httpUrls.name }}的寄信名单中退订。<br />
          您使用我们的网站意味着您同意按照如上所述使用Cookie，网站信标和像素标签。
          <div class="argee_title">3. 我们如何披露您的个人数据</div>
          在某些服务由我们的授权合作伙伴提供的情况下，我们会如本政策描述与该合作伙伴共享您的个人数据。例如，在您上网购买我们产品时，我们必须与物流服务提供商共享您的个人数据才能安排送货，或者安排合作伙伴提供服务。此外，我们可能在我们的关联公司间共享个人数据。
          <div class="argee_title">4. 如何访问或修改您的个人数据</div>
          您应确保提交的所有个人数据都准确无误。我们会尽力维护个人数据的准确和完整，并及时更新这些数据。<br />
          当适用的法律要求的情况下，您可能(1)有权访问我们持有的关于您的特定的个人数据；(2)要求我们更新或更正您的不准确的个人数据；(3)拒绝或限制我们使用您的个人数据；以及(4)要求我们删除您的个人数据。如果您想行使相关的权利，请在线反馈给我们。为保障安全，您可能需要提供书面请求。如果我们有合理依据认为这些请求存在欺骗性、无法实行或损害他人隐私权，我们则会拒绝处理请求。<br />
          当适用的法律要求的情况下，当我们基于您的同意处理您的个人数据时，您还有权随时撤销您的同意。但撤销同意不会影响撤销前我们基于您的同意处理您个人数据的合法性及效力，也不影响我们基于其他适当的正当性基础处理您的个人数据。<br />
          如果您认为我们对您的个人信息的处理不符合适用的数据保护法律，您可以与法定的数据保护机构联系。
          <div class="argee_title">5. 我们如何保护和留存您的个人数据</div>
          我们重视个人数据的安全。我们采用适当的物理、管理和技术保障措施来保护您的个人数据不被未经授权访问、披露、使用、修改、损坏或丢失。例如，我们会使用加密技术确保数据的机密性；我们会使用保护机制防止数据遭到恶意攻击；我们会部署访问控制机制，确保只有授权人员才可访问个人数据；以及我们会举办安全和隐私保护培训课程，加强员工对于保护个人数据重要性的认识。我们会尽力保护您的个人数据，但是请注意任何安全措施都无法做到无懈可击。
          我们将会在达成本政策所述目的所需的期限内保留您的个人数据，除非按照法律要求或许可需要延长保留期或受到法律的允许。因为基于不同的场景和产品及服务的不同，数据的存储期可能会有所不同，我们用于确定存留期的标准包括：完成该业务目的需要留存个人数据的时间，包括提供产品和服务，维护相应的交易及业务记录，管控并提升产品与服务性能与质量，保证系统、产品和服务的安全，应对可能的用户查询或投诉，问题定位等；用户是否同意更长的留存期间；法律、合同等是否有保留数据的特殊要求等。只要您的账户是为您提供服务必须，我们都将保留您的注册信息。您也可以选择注销您的账号，在您注销账号后，我们会停止基于该账号提供产品和服务，并在无特殊法律要求的情况下，删除您相应的个人数据。
          <div class="argee_title">6. 我们如何处理儿童的个人数据</div>
          我们的产品、网站和服务主要面向成人。如果没有父母或监护人的同意，儿童不得创建自己的用户帐户。对于经父母同意而收集儿童个人数据的情况，我们只会在受到法律允许、父母或监护人明确同意或者保护儿童所必要的情况下使用或披露此数据。
          如果我们发现自己在未事先获得可证实的父母同意的情况下收集了儿童的个人数据，则会设法尽快删除相关数据。
          <div class="argee_title">7. 第三方提供商及其服务</div>
          为确保流畅的浏览体验，您可能会收到来自我们及其合作伙伴外部的第三方（下文简称“第三方”）提供的内容或网络链接。我们对此类第三方无控制权。您可选择是否访问第三方提供的链接、内容、产品和服务。
          我们无法控制第三方的隐私和数据保护政策，此类第三方不受到本政策的约束。在向第三方提交个人信息之前，请参见这些第三方的隐私保护政策。
          <div class="argee_title">8. 您的个人数据如何在全球范围转移</div>
          我们是一家跨国公司，这意味着，我们收集的您的个人数据可能会在您使用产品或服务所在国家/地区、在我们或其关联公司、子公司或服务提供商、业务合作伙伴设有机构的其他国家/地区进行处理，或者受到来自这些国家/地区的访问。这些国家/地区的数据保护法可能不同。在此类情况下，我们会采取措施确保我们收集的数据依据本政策和适用法律的要求进行处理。
          <div class="argee_title">9. 本政策如何更新</div>
          我们保留不时更新或修改本政策的权利。如果我们的隐私政策变更，我们会将最新版隐私政策发布在这里。如果我们对隐私政策做出了重大变更，我们还可能会通过不同渠道向您发送变更通知，例如，在我们的网站上发布通知或者向您发布单独的通知。
          当我们按照本隐私政策处理您的个人数据时，响应您的请求、与您联系、向您提供产品或服务或与您达成或即将达成合同的我们实体是相关个人数据的控制者。
        </div>
        <div class="time">
          本政策最新修订时间：2023年05月15日
        </div>
      </div>

      <!-- 
          会员协议
        -->
      <div class="agree_cont" v-if="agreeVisibleTwo">
        用户及会员协议<br />
        本协议是用户(以下简称“您”)与本网站(以下简称“本网站”)之间就本网站提供的服务所签订的协议。<br />
        您在使用本网站提供的服务之前，应当仔细阅读本协议，对于本协议中以加粗字体显示的内容，您应重点阅读。<br />
        <div class="argee_title">一、用户账号</div>
        1.为了能够使用本网站提供的服务，您应当先注册一个用户账号。<br />
        2.您在注册时应当按照本网站的要求提供真实准确的个人信息。<br />
        3.您有义务维护您的用户账号及密码的安全，因您未能保管好账号及密码而造成的任何损失由您自行承担。<br />
        <div class="argee_title">二、用户权利义务</div>
        1.您有权了解本网站的服务内容及收费标准。<br />
        2.您有义务按照本网站规定的服务流程及时完成相关操作。<br />
        3.您有义务遵守国家有关法律法规及本网站的相关规定。<br />
        <div class="argee_title">三、隐私保护</div>
        1.本网站重视用户的个人隐私保护，在您使用本网站服务时，本网站将按照本协议的规定收集、使用及共享您的个人信息。<br />
        2.您可以在本网站的账号设置中查看、修改您提供的个人信息及隐私设置。<br />
        3.本网站将采取合理措施保护您的个人信息，除本协议另有规定外，本网站不会将您的个人信息共享、出售或传播给任何第三方。
        <div class="argee_title">四、免责声明</div>
        1.您理解并同意，您使用本网站服务所存在的风险将完全由您自行承担;因您使用本网站服务而产生的一切后果也由您自行承担，本网站对此不承担任何责任。<br />
        2.本网站无法保证服务一定能满足您的要求，也不能保证服务不会中断，对服务的及时性、安全性、准确性也都不作承诺。<br />
        3.本网站对接openai公司提供的开放接口，以及其他平台官方接口服务，如第三方服务关闭、异常等不可抗拒的原因导致您无法体验服务，我们会更换其他替代公司产品继续为您提供服务，直至服务期结束。<br />
        <div class="argee_title">五、协议的变更及终止</div>
        1.本协议的任何变更将会在本网站上以公示的形式公布，一经公布即成为本协议的一部分，对您产生约束力。<br />
        2.如果您不同意本协议及/或随时对其的修改，您可以主动取消本网站提供的服务;您继续使用本网站提供的服务将被视为您接受本协议及其变动。<br />
        <div class="argee_title">六、法律管辖</div>
        1.本协议的订立、执行及解释均应适用中华人民共和国法律;<br />
        2.如双方就本协议内容或其执行发生任何争议，双方应尽量友好协商解决;协商不成时，任何一方均可向有管辖权的中华人民共和国法院提起诉讼。<br />
      </div>

      <!-- 
            免责声明
        -->
      <div class="agree_cont" v-if="agreeVisibleThree">
        在使用本网站提供的 AI
        服务前，请您务必仔细阅读并理解本《免责声明》（以下简称“本声明”）。请您知悉，如果您选择继续访问本网站、或使用本网站提供的本服务以及通过各类方式利用本网站的行为（以下统称“本服务”），则视为接受并同意本声明全部内容。<br />
        服务仅供个人学习、学术研究目的使用，未经许可，请勿分享、传播输入及生成的文本、图片内容。您在从事与本服务相关的所有行为(包括但不限于访问浏览、利用、转载、宣传介绍)时，必须以善意且谨慎的态度行事；您确保不得利用本服务故意或者过失的从事危害国家安全和社会公共利益、扰乱经济秩序和社会秩序、侵犯他人合法权益等法律、行政法规禁止的活动，并确保自定义输入文本不包含以下违反法律法规、政治相关、侵害他人合法权益的内容：<br />
        1. 反对宪法所确定的基本原则的；危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；<br />
        2. 损害国家荣誉和利益的；<br />
        3. 歪曲、丑化、亵渎、否定英雄烈士事迹和精神，以侮辱、诽谤或者其他方式侵害英雄烈士的姓名、肖像、名誉、荣誉的；<br />
        4. 宣扬恐怖主义、极端主义或者煽动实施恐怖活动、极端主义活动的；<br />
        5. 煽动民族仇恨、民族歧视，破坏民族团结的；<br />
        6. 破坏国家宗教政策，宣扬邪教和封建迷信的；<br />
        7. 散布谣言，扰乱经济秩序和社会秩序的；<br />
        8. 散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；<br />
        9. 侮辱或者诽谤他人，侵害他人名誉、隐私和其他合法权益的；<br />
        10. 含有虚假、有害、胁迫、侵害他人隐私、骚扰、侵害、中伤、粗俗、猥亵、或其它道德上令人反感的内容；<br />
        11. 中国法律、法规、规章、条例以及任何具有法律效力之规范所限制或禁止的其它内容；<br />
        12. 您确认使用本服务时输入的内容将不包含您的个人信息。您同意并承诺，在使用本服务时，不会披露任何保密、敏感或个人信息。<br />
        13.
        您确认并知悉本服务生成的所有内容都是由人工智能模型生成，所以可能会出现意外和错误的情况，请确保检查事实。我们对其生成内容的准确性、完整性和功能性不做任何保证，并且其生成的内容不代表我们的态度或观点，仅为提供更多信息，也不构成任何建议或承诺。对于您根据本服务提供的信息所做出的一切行为，除非另有明确的书面承诺文件，否则我们不承担任何形式的责任。<br />
        14. 本服务来自于法律法规允许的包括但不限于公开互联网等信息积累，因互联网的开放性属性，不排除其中部分信息具有瑕疵、不合理或引发不快。遇有此情形的，欢迎并感谢您随时通过
        week-8@foxmail.com邮箱举报。<br />
        15.
        不论在何种情况下，本网站均不对由于网络连接故障，电力故障，罢工，劳动争议，暴乱，起义，骚乱，火灾，洪水，风暴，爆炸，不可抗力，战争，政府行为，国际、国内法院的命令，黑客攻击，互联网病毒，网络运营商技术调整，政府临时管制或任何其他不能合理控制的原因而造成的本服务不能访问、服务中断、信息及数据的延误、停滞或错误，不能提供或延迟提供服务而承担责任。<br />
        16.
        当本服务以链接形式推荐其他网站内容时，我们并不对这些网站或资源的可用性负责，且不保证从这些网站获取的任何内容、产品、服务或其他材料的真实性、合法性。在法律允许的范围内，本网站不承担您就使用本服务所提供的信息或任何链接所引致的任何直接、间接、附带、从属、特殊、继发、惩罚性或惩戒性的损害赔偿。<br />
      </div>

      <!-- 
            用户协议
        -->
      <div class="agree_cont" v-if="agreeVisibleFour">
        尊敬的用户： 欢迎使用我们的网络服务！在使用我们的服务前，请您仔细阅读以下协议，以确保您的权益受到保护。 <br />
        <div class="argee_title">1. 服务条款</div>
        1.1 本协议是您与我们之间的约定，适用于您使用我们提供的所有网络服务。
        1.2 您在使用我们的服务时，必须遵守相关法律法规，不得利用我们的服务从事任何违法或者侵犯他人权益的行为。
        1.3 我们有权根据需要修改本协议，并在网站上公示。修改后的协议自公示之日起生效。如果您不同意修改后的协议，可以选择停止使用我们的服务。
        <div class="argee_title">2. 用户账号</div>
        2.1 您在使用我们的服务前，需要注册一个账号。您需要提供真实、准确、完整的个人信息，并及时更新。如果您提供的信息不真实、不准确、不完整，我们有权拒绝您的注册申请或者注销您的账号。
        2.2 您的账号仅限于您本人使用，不得转让、出售或者借给他人使用。如果您发现有他人盗用您的账号，应及时通知我们，我们将采取措施保护您的权益。
        2.3 您需要妥善保管自己的账号和密码，不得将其泄露给他人。如果您的账号和密码被他人获取，应及时通知我们，我们将采取措施保护您的权益。
        <div class="argee_title">3. 服务内容</div>
        3.1 我们提供的服务包括但不限于：AI咨询、AI服务等。
        3.2 您在使用我们的服务时，应遵守相关法律法规和本协议，不得利用我们的服务从事任何违法或者侵犯他人权益的行为。
        <div class="argee_title">4. 用户隐私</div>
        4.1 我们非常重视您的个人隐私，我们将严格保护您的个人信息，不会将其泄露给任何第三方。
        4.2 在使用我们的服务时，收到您的电话号码的。我们将仅限于为您提供服务的目的使用这些信息。
        4.3 如果您发现我们泄露了您的个人信息，应及时通知我们，我们将采取措施保护您的权益。
        <div class="argee_title">5. 其他条款</div>
        5.1 本协议的解释、执行和争议解决均适用中华人民共和国法律。
        5.2 如果本协议的任何条款被认定为无效或者不可执行，不影响其他条款的效力。
        5.3 本协议的最终解释权归我们所有。 感谢您阅读以上协议，如果您同意并愿意遵守以上条款，请开始使用我们的服务。
      </div>

      <!-- 
            分销会员协议
        -->
      <div class="agree_cont" v-if="agreeVisibleFive">
        本协议由服务提供方（以下简称"本网站"）和服务接受方（以下简称"您"）共同订立，双方本着平等互利的原则，就本网站向您提供付费服务达成如下协议：
        <div class="argee_title">一、服务内容：</div>
        “本网站”向“您”提供以下具体的付费服务（“钻石分销”价格为CNY￥99.00元，有效时间为购买成功时间起到365天后失效，在“钻石分销”有效期内，成为我的成员后前三次购买返利比例从30%提升至40%），我的成员前三次购买后将不再提供返利功能。返利权益仅包含（本系统“流量包”）
        <div class="argee_title">二、服务费用及支付方式：</div>
        “您”应按照“本网站”规定的收费标准支付相应的服务费用。“本网站”可以选择以下支付方式：（微信、支付宝）。“您”应在服务提供前支付全部或部分费用。“本网站”在收到“您”支付的费用后，才开始提供服务。
        <div class="argee_title">三、服务期限：</div>
        服务期限为（365天），自“本网站”确认接受“您”的付款起计算。“本网站”需要在服务期限届满前提前通知“您”是否续订服务或终止服务。
        <div class="argee_title">三、乙方权利和义务：</div>
        3.1 “您”应按照甲方提供的使用规则和要求使用付费服务。<br />
        3.2 “您”应按照约定的支付方式和时间支付服务费用。<br />
        3.3 “您”在使用付费服务期间如有任何问题或需要帮助，应及时与“本网站”进行沟通和协调。<br />
        <div class="argee_title">四、甲方权利和义务：</div>
        4.1 “本网站”应按照约定提供付费服务，并保证服务的质量和效果。<br />
        4.2 “本网站”有权收取“您”约定的服务费用。<br />
        4.3 “本网站”在提供付费服务期间如有任何问题或需要帮助，应及时与“您”进行沟通和协调<br />
        <div class="argee_title">五、免责声明：</div>
        5.1 “您”理解并同意，您使用“本网站”服务所存在的风险将完全由“您”自行承担;因“您”使用本网站服务而产生的一切后果也由“您”自行承担，“本网站”对此不承担任何责任。<br />
        5.2 “本网站”无法保证服务一定能满足“您”的要求，也不能保证服务不会中断，对服务的及时性、安全性、准确性也都不作承诺。<br />
        5.3 “本网站”对接openai公司提供的开放接口，以及其他平台官方接口服务，如第三方服务关闭、异常等不可抗拒的原因导致“您”无法体验服务，我们会更换其他替代公司产品继续为“您”提供服务，直至服务期结束。<br />
        <div class="argee_title">六、协议的变更及终止：</div>
        6.1 本协议的任何变更将会在本网站上以公示的形式公布，一经公布即成为本协议的一部分，对“您”产生约束力。<br />
        6.3 如果“您”不同意本协议及/或随时对其的修改，“您”可以主动取消“本网站”提供的服务;“您”继续使用本网站提供的服务将被视为”您”接受本协议及其变动。<br />
        <div class="argee_title">七、法律管辖：</div>
        7.1 本协议的订立、执行及解释均应适用中华人民共和国法律;<br />
        7.2 如双方就本协议内容或其执行发生任何争议，双方应尽量友好协商解决;协商不成时，任何一方均可向有管辖权的中华人民共和国法院提起诉讼。<br />
      </div>

      <!-- 
            优秘数字人定制服务协议
           -->

      <div class="agree_cont" v-if="agreeVisibleSix">
        <strong>为保证用于数字人形象定制的视频的拍摄环境、分辨率等能顺利通过硅语平台审核并成功完成数字人形象定制，请您先阅读并遵守以下数字人定制服务须知：</strong><br />
        1、最终定制效果与上传的原视频中画面、光线、动作等基本一致，请确保原视频状态为个人的理想状态（若有美颜需求，请上传美颜后的视频）。<br />
        2、若您想定制可替换背景的数字人，定制过程中会涉及到形象的抠图，为保证实现效果，请您使用绿色幕布作为上传视频中的人像拍摄背景。<br />
        3、订单提交后，为了保证定制效果的质量，我们将会对您提交的视频进行智能检测有效视频审核。（注：平台的审核行为并不视为免除您对视频的真实性、准确性、合法性性以及有效性的保证责任）。<br />
        <strong>（1）若您提交的视频不符合定制要求，您将会收到短信通知和平台消息推送，可查看审核失败检测报告，并需要您按照拍摄要求重新上传；</strong><br />
        <strong>（2）若您提交的视频有部分片段不符合要求，我们将会为您提炼出符合定制的视频片段（不低于30s），您将会收到短信通知和平台消息推送，可查看受影响的检测报告，并需要您手动二次确认是否提交训练或者重新上传，确认提交后会基于有效视频，自动进入制作流程；</strong><br />
        <strong>（3）若您提交的视频全部符合定制要求，系统将会自动检测审核通过。审核通过后，将自动进入制作流程，制作过程中若有片段影响训练，平台会做优化调整；整个制作环节预计在0.1~1个工作日内完成，请您耐心等待。定制成功后您将会收到短信通知和平台消息推送。</strong><br />
        4、定制完成后，1999/年的价格，您可获得该定制形象永久的使用权。
      </div>

      <!-- 
            声音克隆协议
           -->

      <div class="agree_cont" v-if="agreeVisibleSeven">
        1、用户上传的声音等音频应为用户本人的声音，用户不得上传他人的声音进行声音克隆，也不得实施任何侵犯他人声音权等合法权益的行为。<br />
        2、用户应自行对其提供的声音等信息资料、利用我司提供的服务所从事的活动、通过我司提供的产品进行的活动所引起的一切后果承担全部责任，我司对此不承担任何责任。<br />
        3、用户使用声音克隆产品及相关服务，以及制作、发布、传播的内容应自觉遵守法律法规、社会主义制度、国家利益、公民合法权益、社会公共秩序、道德风尚、公序良俗和信息真实性等“七条底线”要求，否则我司将立即采取相应处理措施（包括但不限于：注销账号等）。用户不得发表下列信息，也不得利用声音克隆产品及相关服务进行如下行为：<br />
        <strong>（1）反对宪法确定的基本原则的；</strong> <br />
        <strong>（2） 危害国家安全，泄露国家秘密；</strong><br />
        <strong>（3）颠覆国家政权，推翻社会主义制度，煽动分裂国家，破坏国家统一的；</strong><br />
        <strong>（4） 损害国家荣誉和利益的；</strong><br />
        <strong>（5）百物效布干不喻干的；</strong><br />
        <strong>（6） 宣扬民族仇恨、民族歧视，破坏民族团结的；</strong><br />
        <strong>（7）煽动地域歧视、地域仇恨；</strong><br />
        <strong>（8）破坏国家宗教政策，宣扬邪教和迷信的；</strong><br />
        <strong>（9）编造、散布谣言、虚假信息，扰乱社会秩序、破坏社会稳定的；</strong><br />
        <strong>（10）散布、传播淫杨、巴情、赌傅、泰刀、凶余、芯怖或者教唆犯菲的；</strong><br />
        <strong>（11）危害网络安全、利用网络从事危害国家安全、荣誉和利益的；</strong><br />
        <strong>（12）侮辱或者诽谤他人，侵害他人合法权益的；</strong><br />
        <strong>（13） 对他人进行暴力恐吓、威胁，实施人肉搜索的；</strong><br />
        <strong>（14）涉及他人隐私、个人信息或资料的；</strong><br />
        <strong>（15）散布污言秽语，损害社会公序良俗的；</strong><br />
        <strong>（16）侵犯他人隐私权、名誉权、肖像权、声音权、知识产权等合法权益内容的；</strong><br />
        <strong>（17）侵害未成年人合法权益或者损害未成年人身心健康的；</strong><br />
        <strong>（18）包含恐怖、暴力血腥、高危险性、危害自身或他人身心健康内容的，包括但不限于以下情形：</strong><br />
        <strong>1） 任何暴力和/或自残行为内容；</strong><br />
        <strong>2） 任何威胁生命健康，或危及自身或他人人身及/或财产权利的内容；</strong><br />
        <strong>3） 怂恿、诱导他人参与可能会造成人身伤害或导致死亡的危险或违法活动的内容。</strong><br />
        <strong>（19） 其他违反法律法规、政策及公序良俗、干扰本软件/平台正常运营或侵犯其他用户或第三方合法权益内容的其他信息。</strong><br />
        4、用户还应遵守本软件/平台的《用户协议》的约定。<br />
        5、如用户违反前述规定，我司有权随时限制或拒绝您使用账号，甚至注销账号。<br />
        6、因用户违反法律法规、《用户协议》或本使用规范造成处罚、违约或侵犯第三方合法权益等的，由用户自行解决。如果给我司造成损失，我司有权向用户追偿其因此所遭受的全部损失（包括其直接损失、间接损失、预期利益损失等），我司因维权所支出的合理费用（包括但不限于律师费、差旅费、公证费、诉讼费等）均由用户承担。
      </div>
    </el-dialog>
  </div>
</template>
<script type="text/ecmascript-6">
import httpUrls from '../api/requestURL'
export default {
  name: 'agree',

  data() {
    return {
      httpUrls,
      agreeVisibleParent: false,
      agreeVisibleOne: false,
      agreeVisibleTwo: false,
      agreeVisibleThree: false,
      agreeVisibleFour: false,
      agreeVisibleFive: false,
      agreeVisibleSix: false,
      agreeVisibleSeven: false,
      title: '用户协议和隐私政策',
      id: 1
    }
  },

  watch: {
    agreeVisibleOne: {
      deep: true,
      handler() {
        this.title = '用户协议和隐私政策'
      }
    },
    agreeVisibleTwo: {
      deep: true,
      handler() {
        this.title = '会员协议'
      }
    },
    agreeVisibleThree: {
      deep: true,
      handler() {
        this.title = '免责声明'
      }
    },
    agreeVisibleFour: {
      deep: true,
      handler() {
        this.title = '用户协议'
      }
    },
    agreeVisibleFive: {
      deep: true,
      handler() {
        this.title = '付费服务协议'
      }
    },
    agreeVisibleSix: {
      deep: true,
      handler() {
        this.title = '优秘数字人定制服务协议'
      }
    },
    agreeVisibleSeven: {
      deep: true,
      handler() {
        this.title = '声音克隆协议'
      }
    },
  },
  // 创建完毕状态(里面是操作)
  created() {
    // console.log(this.$refs);
  },

  // 里面的函数只有调用才会执行
  methods: {
    closeDialog() {
      this.agreeVisibleOne = false
      this.agreeVisibleTwo = false
      this.agreeVisibleThree = false
      this.agreeVisibleFour = false
      this.agreeVisibleFive = false
      this.agreeVisibleSix = false
      this.agreeVisibleSeven = false
    },
  }
}
</script>
  
<style scoped>
.agree_cont {
  /* font-family: 'PingFang SC'; */
  font-style: normal;
  font-weight: 500;
  font-size: 14px;
  line-height: 150%;
  color: #333;
  height: 70vh;
  /* padding: 0 20px; */
  overflow-y: auto;
  height: 500px;
}

.time {
  /* font-family: 'PingFang SC'; */
  font-style: normal;
  font-weight: 500;
  font-size: 16px;
  line-height: 150%;
  color: #333;
  text-align: right;
  /* padding: 20px; */
}

.argee_title {
  font-size: 18px;
  font-weight: bold;
  line-height: 30px;
}

.argee_title-little {
  font-size: 16px;
  font-weight: bold;
}

ul {
  margin: 0;
}</style>
  